#define _CRT_SECURE_NO_WARNINGS
// 逻辑操作符
// && - 左边为假，右边不计算
// || - 左边为真，右边不计算 
//int main()
//{
//    //逻辑与(并且)
//    int a = 3;
//    int b = 5;
//    int c = a && b;//c = 1;c真，0为假
//    //逻辑或(或者)
//    int d = a || b;//只要有一个为真，就为真
//    int i = 0, a = 0, b = 2,c = 3, d = 4;
//    i = a++ && ++b && d++;//i = 0,a = 1,b = 2,c = 3,d = 4;
//    f = a++ || ++b || d++;//f = 1,a = 1,b = 3,c = 3,d = 4;
//    return 0;
//}
                          // 三目表达式
//int main()
//{
//    int a, b;
//    if (a > 5)
//    {
//        b = 3;
//    }
//    else
//    {
//        b = -3;
//    }
//    (a > 3) ? b = 3 : b = -3;// b = a > 5 ? 3 : -3;
//    return 0;
//}
                             // 逗号表达式:从左至右依次执行，整个表达式的结果是最后一个表达式的结果
// a = 1 , b = 2; 
//     无意义   a = 12    12  b = 12 +1     
// c = (a > b, a = b + 10, a, b = a + 1);//c = 13;
// 
// 
// 
                            //下标引用操作符 
//arr[7]--->*(arr+7)---->7[arr]
//arr是数组首元素的地址
//arr+7就是跳过7个元素，指向了第八的元素
//*(arr+7)就是第八个元素
//
